FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_EMAC.c
typedef struct {
    __IO uint32_t CTRLSTAT;     /*!< TDES control and status word */
    __IO uint32_t BSIZE;        /*!< Buffer 1/2 byte counts */
    __IO uint32_t B1ADD;        /*!< Buffer 1 address */
    __IO uint32_t B2ADD;        /*!< Buffer 2 or next descriptor address */
} ENET_TXDESC_T;

/**
 * @brief Structure of a enhanced transmit descriptor (with timestamp)
 */
typedef struct {
    __IO uint32_t CTRLSTAT;     /*!< TDES control and status word */
    __IO uint32_t BSIZE;        /*!< Buffer 1/2 byte counts */
    __IO uint32_t B1ADD;        /*!< Buffer 1 address */
    __IO uint32_t B2ADD;        /*!< Buffer 2 or next descriptor address */
    __IO uint32_t TDES4;        /*!< Reserved */
    __IO uint32_t TDES5;        /*!< Reserved */
    __IO uint32_t TTSL;         /*!< Timestamp value low */
    __IO uint32_t TTSH;         /*!< Timestamp value high */
} ENET_ENHTXDESC_T;

/**
 * @brief Structure of a receive descriptor (without timestamp)
 */
typedef struct {
    __IO uint32_t STATUS;       /*!< RDES status word */
    __IO uint32_t CTRL;         /*!< Buffer 1/2 byte counts and control */
    __IO uint32_t B1ADD;        /*!< Buffer 1 address */
    __IO uint32_t B2ADD;        /*!< Buffer 2 or next descriptor address */
} ENET_RXDESC_T;

#define RXDESC_STATUS_OWN       (1UL<<31) //!< Own Bit
#define RXDESC_STATUS_AFM       (1UL<<30) //!< Destination Address Filter Fail
#define RXDESC_STATUS_FLEN(x)   (((x)>>16)&0x3FFF) //!< Frame Length
#define RXDESC_STATUS_ES        (1UL<<15) //!< Error Summary
#define RXDESC_STATUS_DE        (1UL<<14) //!< Descriptor Error
#define RXDESC_STATUS_SAF       (1UL<<13) //!< Source Address Filter Fail
#define RXDESC_STATUS_LE        (1UL<<12) //!< Length Error
#define RXDESC_STATUS_OE        (1UL<<11) //!< Overflow Error
#define RXDESC_STATUS_VLAN      (1UL<<10) //!< VLAN Tag
#define RXDESC_STATUS_FS        (1UL<< 9) //!< First Descriptor
#define RXDESC_STATUS_LS        (1UL<< 8) //!< Last Descriptor
#define RXDESC_STATUS_TSA       (1UL<< 7) //!< Timestamp available
#define RXDESC_STATUS_LC        (1UL<< 6) //!< Late Collision
#define RXDESC_STATUS_FT        (1UL<< 5) //!< Frame Type
#define RXDESC_STATUS_RWT       (1UL<< 4) //!< Receive Watchdog Timeout
#define RXDESC_STATUS_RE        (1UL<< 3) //!< Receive Error
#define RXDESC_STATUS_DRIBBLE   (1UL<< 2) //!< Dribble Bit Error
#define RXDESC_STATUS_CE        (1UL<< 1) //!< CRC Error
#define RXDESC_STATUS_ESA       (1UL<< 0) //!< Extended Status Available

#define TXDESC_STATUS_OWN       (1UL<<31) //!< Own Bit
#define TXDESC_STATUS_IC        (1UL<<30) //!< Interrupt on Completion
#define TXDESC_STATUS_LS        (1UL<<29) //!< Last Segment
#define TXDESC_STATUS_FS        (1UL<<28) //!< First Segment
#define TXDESC_STATUS_CRC       (1UL<<27) //!< Disable CRC
#define TXDESC_STATUS_DP        (1UL<<26) //!< Disable Pad
#define TXDESC_STATUS_TTSE      (1UL<<25) //!< Transmit Timestamp Enable
#define TXDESC_STATUS_TER       (1UL<<21) //!< Transmit End of Ring
#define TXDESC_STATUS_TCH       (1UL<<20) //!< Second Address Chained
#define TXDESC_STATUS_TTSS      (1UL<<17) //!< Transmit Timestamp Status
#define TXDESC_STATUS_IHE       (1UL<<16) //!< IP Header Error
#define TXDESC_STATUS_ES        (1UL<<15) //!< Error Summary
#define TXDESC_STATUS_JT        (1UL<<14) //!< Jabber Timeout
#define TXDESC_STATUS_FF        (1UL<<13) //!< Frame Flushed
#define TXDESC_STATUS_IPE       (1UL<<12) //!< IP Payload Error
#define TXDESC_STATUS_LC        (1UL<<11) //!< Loss of Carrier
#define TXDESC_STATUS_NC        (1UL<<10) //!< No Carrier
#define TXDESC_STATUS_LCOLI     (1UL<< 9) //!< Late Collision
#define TXDESC_STATUS_EC        (1UL<< 8) //!< Excessive collision
#define TXDESC_STATUS_VF        (1UL<< 7) //!< VLAN Frame
#define TXDESC_STATUS_CC        (1UL<< 3) //!< 6:3 Collision count
#define TXDESC_STATUS_ED        (1UL<< 2) //!< Excessive Deferral
#define TXDESC_STATUS_UF        (1UL<< 1) //!< Underflow Error
#define TXDESC_STATUS_DB        (1UL<< 0) //!< Deferred Bit

/**
 * @brief Structure of a enhanced receive descriptor (with timestamp)
 */
typedef struct {
    __IO uint32_t STATUS;       /*!< RDES status word */
    __IO uint32_t CTRL;         /*!< Buffer 1/2 byte counts */
    __IO uint32_t B1ADD;        /*!< Buffer 1 address */
    __IO uint32_t B2ADD;        /*!< Buffer 2 or next descriptor address */
    __IO uint32_t EXTSTAT;      /*!< Extended Status */
    __IO uint32_t RDES5;        /*!< Reserved */
    __IO uint32_t RTSL;         /*!< Timestamp value low */
    __IO uint32_t RTSH;         /*!< Timestamp value high */
} ENET_ENHRXDESC_T;

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
extern const HAL_EMAC EMAC_LPC43xx_Interface;
static T_LPC43xx_EMAC_Workspace *G_LPC43xx_EMAC;

#if(EMAC_ENABLE_JUMBO_FRAME == 1)
/* EMAC Memory Buffer configuration for 40.640K Ethernet RAM. */
#define ENET_NUM_TX_DESC 2//         /* Num.of TX Fragments 2*8128= 16.256kB */
#define ENET_NUM_RX_DESC 3//         /* Num.of RX Fragments 3*8128= 24.384kB */

#else

/* EMAC Memory Buffer configuration for 16KB Ethernet RAM. */
//#define ENET_NUM_TX_DESC 2//4         /* Num.of TX Fragments 2*1536= 3.0kB */
//#define ENET_NUM_RX_DESC 8//4         /* Num.of RX Fragments 8*1536= 12.228kB */

/* EMAC Memory Buffer configuration for 43KB Ethernet RAM. */
#define ENET_NUM_TX_DESC 8//         /* Num.of TX Fragments 8*1536= 12.228kB */
#define ENET_NUM_RX_DESC 20//        /* Num.of RX Fragments 20*1536= 30.72kB */
#endif

static ENET_ENHTXDESC_T TXDescs[ENET_NUM_TX_DESC]EMAC_MEMORY;
static ENET_ENHRXDESC_T RXDescs[ENET_NUM_RX_DESC]EMAC_MEMORY;

/* Transmit/receive buffers and indices */
static TUInt8 TXBuffer[ENET_NUM_TX_DESC][EMAC_ETH_MAX_FLEN]EMAC_MEMORY;
static TUInt8 RXBuffer[ENET_NUM_RX_DESC][EMAC_ETH_MAX_FLEN]EMAC_MEMORY;
//static int32_t rxFill, rxGet, rxAvail, rxNumDescs;
//static int32_t txFill, txGet, txUsed, txNumDescs;

/*---------------------------------------------------------------------------*
 * Routine:  IPHYWrite
 *---------------------------------------------------------------------------*
 * Description:
 *      Write the register in the given PHY to the given value.
 * Inputs:
 *      T_LPC43xx_EMAC_Workspace *p -- EMAC's Workspace
 *      TUInt32 aPhyReg             -- PHY register to write
 *      TUInt32 aValue              -- Value to write to register
 *---------------------------------------------------------------------------*/
static void IPHYWrite(T_LPC43xx_EMAC_Workspace *p, TUInt8 PhyReg, TUInt32 Value)
{
    TUInt32 timeout;

    LPC_ETHERNET->MAC_MII_ADDR = p->iSettings.iPHYAddr | (4 << 2) | (PhyReg << 6);
    LPC_ETHERNET->MAC_MII_DATA = Value;
    LPC_ETHERNET->MAC_MII_ADDR |= (1<<1);
    LPC_ETHERNET->MAC_MII_ADDR |= (1<<0);

    for (timeout = 0; timeout < MII_WR_TOUT; timeout++) {
        if ((LPC_ETHERNET->MAC_MII_ADDR & (1 << 0)) == 0) {
            break;
        }
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  IPHYRead
 *---------------------------------------------------------------------------*
 * Description:
 *      Read the register from the given PHY.
 * Inputs:
 *      T_LPC43xx_EMAC_Workspace *p -- EMAC's Workspace
 *      TUInt32 aPhyReg             -- PHY register to write
 *      TUInt32 aValue              -- Value to write to register
 *---------------------------------------------------------------------------*/
static TUInt16 IPHYRead(T_LPC43xx_EMAC_Workspace *p, TUInt8 PhyReg)
{
    TUInt32 timeout;

    LPC_ETHERNET->MAC_MII_ADDR = p->iSettings.iPHYAddr | (4 << 2) | (PhyReg << 6);
    LPC_ETHERNET->MAC_MII_ADDR |= (1<<0);

    // Wait until operation completed
    for (timeout = 0; timeout < MII_RD_TOUT; timeout++) {
        if ((LPC_ETHERNET->MAC_MII_ADDR & (1 << 0)) == 0) {
            break;
        }
    }

