FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_EMAC.c
    return (TUInt16)(LPC_ETHERNET->MAC_MII_DATA);
}

/*---------------------------------------------------------------------------*
 * Routine:  IEMACConfigPHY_National
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure for the National PHY
 * Inputs:
 *      T_LPC17xx_40xx_EMAC_Workspace *p -- EMAC's Workspace
 *---------------------------------------------------------------------------*/
static T_uezError IEMACConfigPHY_National(T_LPC43xx_EMAC_Workspace *p)
{
    T_uezError error = UEZ_ERROR_NONE;
    TUInt32 timeout, regv;

    // Force ON Auto-MDIX
    IPHYWrite(p, PHY_REG_PHYCR, IPHYRead(p, PHY_REG_PHYCR) | (1 << 15));

    // auto negotiation, restart AN
    // RE_AN should be self cleared
    IPHYWrite(p, PHY_REG_BMCR, PHY_AUTO_NEG);

    // Wait to complete Auto_Negotiation.
    for (timeout = 0; timeout < 10; timeout++) {
        UEZTaskDelay(100);
        regv = IPHYRead(p, PHY_REG_BMSR);
        if (regv & 0x0020) {
            // Autonegotiation Complete.
            break;
        }
    }

    // Check the link status.
    if (error == UEZ_ERROR_NONE) {
        error = UEZ_ERROR_TIMEOUT;
        for (timeout = 0; timeout < 10; timeout++) {
            UEZTaskDelay(100);
            regv = IPHYRead(p, PHY_REG_STS);
            if (regv & 0x0001) {
                // Link is on.
                error = UEZ_ERROR_NONE;
                break;
            }
        }
    }

    if (error == UEZ_ERROR_NONE) {
        // Configure Full/Half Duplex mode.
        if (regv & 0x0004) {
            // Full duplex is enabled.
            //LPC_EMAC->MAC2 |= MAC2_FULL_DUP;
            //LPC_EMAC->Command |= CR_FULL_DUP;
            //LPC_EMAC->IPGT = IPGT_FULL_DUP;
        } else {
            // Half duplex mode.
            //LPC_EMAC->IPGT = IPGT_HALF_DUP;
        }

        // Configure 100MBit/10MBit mode.
        if (regv & 0x0002) {
            // 10MBit mode.
            //LPC_EMAC->SUPP = 0;
        } else {
            // 100MBit mode.
            //LPC_EMAC->SUPP = SUPP_SPEED;
        }
    }

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  IEMACConfigPHY_Micrel
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure for the Micrel PHY
 * Inputs:
 *      T_LPC17xx_40xx_EMAC_Workspace *p -- EMAC's Workspace
 *---------------------------------------------------------------------------*/
static T_uezError IEMACConfigPHY_Micrel(T_LPC43xx_EMAC_Workspace *p)
{
    T_uezError error = UEZ_ERROR_NONE;
    TUInt32 timeout, regv;
#if DEBUG_LPC43xx_EMAC_STARTUP
    TUInt32 reg;
#endif
    // auto negotiation, restart AN
    // RE_AN should be self cleared
    IPHYWrite(p, PHY_REG_BMCR,(1 << 12));// PHY_AUTO_NEG);

    // Wait to complete Auto_Negotiation.
    for (timeout = 0; timeout < 30; timeout++) {
#if DEBUG_LPC43xx_EMAC_STARTUP
        printf(".");
#endif
        UEZTaskDelay(100);
        regv = IPHYRead(p, PHY_REG_BMSR);
        if (regv & (BMSR_AUTO_DONE | BMSR_LINK_ESTABLISHED)) {
            // Autonegotiation Complete.
            break;
        }
    }

    regv = IPHYRead(p, MIC_PHY_100BASE_PHY_CTRL);
#if DEBUG_LPC43xx_EMAC_STARTUP
    printf("nego regv %04X\n", regv);
#endif
    // successful negotiations; update link info
    regv &= 0x001C;
    switch (regv) {
        case 0x0004:
            // Half duplex mode.
            LPC_ETHERNET->MAC_CONFIG &= ~(1 << 11);
            // 10MBit mode.
            LPC_ETHERNET->MAC_CONFIG &= ~(1 << 14);
            break;
        case 0x0008:
            // Half duplex mode.
            LPC_ETHERNET->MAC_CONFIG &= ~(1 << 11);
            // 100MBit mode.
            LPC_ETHERNET->MAC_CONFIG |= (1 << 14);
            break;
        case 0x0014:
            // Full duplex is enabled.
            LPC_ETHERNET->MAC_CONFIG |= (1 << 11);
            // 10MBit mode.
            LPC_ETHERNET->MAC_CONFIG &= ~(1 << 14);
            break;
        case 0x0018:
            // Full duplex is enabled.
            LPC_ETHERNET->MAC_CONFIG |= (1 << 11);
            // 100MBit mode.
            LPC_ETHERNET->MAC_CONFIG |= (1 << 14);
            //LPC_EMAC->SUPP = SUPP_SPEED;
            break;
        default: // Should not come here, force to set default, 100 FULL_DUPLEX
            // Full duplex is enabled.
            LPC_ETHERNET->MAC_CONFIG |= (1 << 11);
            // 100MBit mode.
            LPC_ETHERNET->MAC_CONFIG |= (1 << 14);
            //LPC_EMAC->SUPP = SUPP_SPEED;
            break;
    }

    //IPHYWrite(p, PHY_REG_RBR, (1 << 5));

#if DEBUG_LPC43xx_EMAC_STARTUP
    for (reg = 0; reg < 32; reg++) {
        regv = IPHYRead(p, reg);
        printf("phyreg %d = %04X\n", reg, regv);
    }
#endif

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC43xx_EMAC_InitRxDescriptors
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize Receive Descriptors
 *
 *      Received Descriptors are setup in a ring formation.  B1ADD points
 *      to its own buffer.  B2ADD points to the next buffer in the ring
 *      telling the DMA where to go next.  All buffers start out with OWN
 *      set to allow the DMA to fill all blocks as they come in.
 *      As a safety precaution, the last descriptor has RER set to also
 *      indicate the end of the ring (thus, we probably don't even need
 *      the B2ADD link back to the top).
 *
 *      In this version of code, we are not using split blocks for the
 *      buffers require all buffers to be fully sized packets (1500+ bytes)
 *
 *      RXDesc[0]                                <-----+
 *        B1ADD              --> [= RXBuffer[0] =]     |
 *        B2ADD              -->    RXDesc[1] --+      |
 *      RXDesc[1]                             <-+      |
 *        B1ADD              --> [= RXBuffer[1] =]     |
 *        B2ADD              -->    RXDesc[2] --+      |
 *      RXDesc[2]                             <-+      |
 *        B1ADD              --> [= RXBuffer[2] =]     |
 *        B2ADD              -->    RXDesc[3] --+      |
 *      RXDesc[3]                             <-+      |
 *        B1ADD              --> [= RXBuffer[3] =]     |
 *        B2ADD              -->    RXDesc[0] ---------+
 *
 *---------------------------------------------------------------------------*/
static void ILPC43xx_EMAC_InitRxDescriptors(void)
{
    TUInt32 i;

    memset((void*)RXDescs, 0, sizeof(RXDescs));

    for(i = 0; i < ENET_NUM_RX_DESC; i++){
        RXDescs[i].CTRL = (1<<14);// | (((EMAC_ETH_MAX_FLEN) & 0xFFF) << 0);
        //RXDescs[i].B1ADD = (TUInt32) &RXBuffer[i + 1];
        RXDescs[i].B2ADD = (TUInt32) &RXDescs[i + 1];
    }

    RXDescs[ENET_NUM_RX_DESC - 1].CTRL = (1 << 14) | (1<<15) ;//| (((EMAC_ETH_MAX_FLEN) & 0xFFF) << 0);
    //RXDescs[ENET_NUM_RX_DESC - 1].B1ADD = (TUInt32) &RXBuffer[0];
    RXDescs[ENET_NUM_RX_DESC - 1].B2ADD = (TUInt32) &RXDescs[0];

     // Set EMAC Receive Descriptor Registers.
    LPC_ETHERNET->DMA_REC_DES_ADDR = (TUInt32)RXDescs;

    for(i = 0; i < ENET_NUM_RX_DESC; i++){
        RXDescs[i].B1ADD = (TUInt32) &RXBuffer[i];
        RXDescs[i].CTRL = (1<<14) | (((EMAC_ETH_MAX_FLEN) & 0xFFF) << 0);
        RXDescs[i].STATUS = (TUInt32)(1 << 31);
    }
//    RXDescs[ENET_NUM_RX_DESC - 1].CTRL = (1 << 14) | (1<<15) | (((EMAC_ETH_MAX_FLEN) & 0xFFF) << 0);
//    RXDescs[ENET_NUM_RX_DESC - 1].B1ADD = (TUInt32) &RXBuffer[0];
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC43xx_EMAC_InitTxDescriptors
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize Transmit Descriptors
 *
 *      Transmit Descriptors are setup in a ring formation.  B1ADD points
 *      to its own buffer.  B2ADD points to the next buffer in the ring
 *      telling the DMA where to go next.  All buffers start out with OWN
 *      clear since no data has been put into the buffer yet.
 *      As a safety precaution, the last descriptor has TER set to also
 *      indicate the end of the ring (thus, we probably don't even need
 *      the B2ADD link back to the top).
 *
 *      In this version of code, we are not using split blocks for the
 *      buffers require all buffers to be fully sized packets (1500+ bytes)
 *
 *      TXDesc[0]                                <-----+
 *        B1ADD              --> [= TXBuffer[0] =]     |
 *        B2ADD              -->    TXDesc[1] --+      |
 *      TXDesc[1]                             <-+      |
 *        B1ADD              --> [= TXBuffer[1] =]     |
 *        B2ADD              -->    TXDesc[2] --+      |
 *      TXDesc[2]                             <-+      |
 *        B1ADD              --> [= TXBuffer[2] =]     |
 *        B2ADD              -->    TXDesc[3] --+      |
 *      TXDesc[3]                             <-+      |
 *        B1ADD              --> [= TXBuffer[3] =]     |
 *        B2ADD              -->    TXDesc[0] ---------+
 *
 *---------------------------------------------------------------------------*/
void ILPC43xx_EMAC_InitTxDescriptors(void)
{
    TUInt32 i;

