FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_EMAC.c
    memset((void*)TXDescs, 0, sizeof(TXDescs));

    // Setup desctriptors, 1 for 1, and we'll provide CRC and any data padding (to pad out to 64 byte minimum packets)
    for (i = 0; i < ENET_NUM_TX_DESC; i++) {
        TXDescs[i].CTRLSTAT = (1 << 20) | (3 << 22);
//        TXDescs[i].CTRLSTAT = (1 << 20) | (3 << 22) | TXDESC_STATUS_DP | TXDESC_STATUS_CRC;
        TXDescs[i].B2ADD = (TUInt32) &TXDescs[i + 1];
        TXDescs[i].B1ADD = (TUInt32) &TXBuffer[i];
    }
    TXDescs[ENET_NUM_TX_DESC - 1].CTRLSTAT = (1 << 20) | (1 << 21) | (3 << 23);
//    TXDescs[ENET_NUM_TX_DESC - 1].CTRLSTAT = TXDESC_STATUS_TCH | TXDESC_STATUS_TER | (3 << 22 /* reserved */) | TXDESC_STATUS_DP | TXDESC_STATUS_CRC;
    TXDescs[ENET_NUM_TX_DESC - 1].B2ADD = (TUInt32) &TXDescs[0];

    /* Set EMAC Transmit Descriptor Registers. */
    LPC_ETHERNET->DMA_TRANS_DES_ADDR = (TUInt32)TXDescs;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_DetectEMAC
 *---------------------------------------------------------------------------*
 * Description:
 *      Detect if the EMAC can be found at all.
 * Inputs:
 *      T_LPC43xx_EMAC_Workspace *p -- Workspace
 * Outputs:
 *      T_uezError                 -- Error code of UEZ_ERROR_NOT_FOUND if
 *                                    not detected, else UEZ_ERROR_NONE
 *---------------------------------------------------------------------------*/
#if EMAC_USE_BITBANG_MDIO_DETECT
static T_uezError LPC43xx_EMAC_DetectEMAC(T_LPC43xx_EMAC_Workspace *p)
{
    T_uezError error = UEZ_ERROR_NOT_FOUND;
    T_uezGPIOPortPin pinMDC = p->iMDIOSettings.iPinMDC;
    T_uezGPIOPortPin pinMDIO = p->iMDIOSettings.iPinMDIO;
    T_gpioMux pinMDCMux;
    T_gpioMux pinMDIOMux;
    TUInt32 n;
    TUInt32 v;
    T_mdioBitBangSettings mdio;

    // Check that the MDIO lines are available
    if ((pinMDC != GPIO_NONE) && (pinMDIO != GPIO_NONE)) {
        // Remember what the settings of these pins were
        UEZGPIOGetMux(pinMDC, &pinMDCMux);
        UEZGPIOGetMux(pinMDIO, &pinMDIOMux);

        // Set the signals to high
        UEZGPIOSet(pinMDC);
        UEZGPIOSet(pinMDIO);
        if((pinMDC >> 8) <= 4){
            UEZGPIOSetMux(pinMDC, 0);
        } else {
            UEZGPIOSetMux(pinMDC, 4);
        }
        if((pinMDIO >> 8) <= 4){
            UEZGPIOSetMux(pinMDIO, 0);
        } else {
            UEZGPIOSetMux(pinMDIO, 4);
        }

        mdio.iDelayUSPerHalfBit = 50;// 50 uS per half, kind of slow
        mdio.iIsClause45 = EFalse;
        mdio.iPinMDC = pinMDC;
        mdio.iPinMDIO = pinMDIO;

        for (n=0; n<32; n++) {
#if DEBUG_LPC43xx_EMAC_STARTUP
            printf("LPC43xx_EMAC_DetectEMAC: PHY %d, Reg 2 = ", n);
#endif
            v = MDIOBitBangRead(&mdio, n, 0x0002);
#if DEBUG_LPC43xx_EMAC_STARTUP
            printf("%04X\n", v);
#endif
            if (v != 0xFFFF && v != 0) {
                error = UEZ_ERROR_NONE;
                break;
            }
        }

        // Put the settings back
        UEZGPIOSetMux(pinMDC, pinMDCMux);
        UEZGPIOSetMux(pinMDIO, pinMDIOMux);
    }

    return error;
}
#endif

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure and setup the EMAC screen with the given settings
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 *      T_EMACSettings *aSettings -- Pointer to settings to use
 * Outputs:
 *      T_uezError                -- Error code.  Returns UEZ_ERROR_NOT_FOUND
 *                                  if PHY not connected.
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_EMAC_Configure(void *aWorkspace, T_EMACSettings *aSettings)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_LPC43xx_EMAC_Workspace *p = (T_LPC43xx_EMAC_Workspace *)aWorkspace;
    TUInt32 regv, timeout;
    TUInt32 retry;
    TUInt32 addr = 1;
    TUInt32 uniqueID;
#if 1
    TUInt16 v;
#endif

    // Because the LPC43xx has a problem with EMAC's that are missing,
    // we will detect the EMAC using bit bang I2C
    // Don't allow this if not detected
    if (!p->iIsDetected)
        return UEZ_ERROR_NOT_FOUND;

    // Copy over the settings
    p->iSettings = *aSettings;

    // Shift the phy address now to make the calculations faster
    p->iSettings.iPHYAddr = (p->iSettings.iPHYAddr << 11);

    // Initializes the EMAC Ethernet controller

    // Delay a small amount
    UEZTaskDelay(1);

    LPC_CREG->CREG6 |= 0x4;

    LPC_RGU->RESET_CTRL0 = (1 << 22);

    while((LPC_RGU->RESET_ACTIVE_STATUS0 & (1<<22)) == (1<<22));

    LPC_ETHERNET->DMA_BUS_MODE |= (1<<0);

    while((LPC_ETHERNET->DMA_BUS_MODE & 0x01) == 1);

    LPC_ETHERNET->DMA_BUS_MODE = /*(1 << 1) |*/ (1 << 7) | (1 << 8) | (1 << 17);

    LPC_ETHERNET->MAC_CONFIG =  (3<<17) | (1<<15) | (1 << 14) | (1<<13) | (1 << 11) | (1 << 10);

    /* Setup default filter */
    LPC_ETHERNET->MAC_FRAME_FILTER = (1<<0) | (1UL<<31);

    /* Flush transmit FIFO */
    LPC_ETHERNET->DMA_OP_MODE = (1<<20);

    /* Setup DMA to flush receive FIFOs at 32 bytes, service TX FIFOs at
       64 bytes */
    LPC_ETHERNET->DMA_OP_MODE |= (1<<3) | (0<<14);

    /* Clear all MAC interrupts */
    LPC_ETHERNET->DMA_STAT = 0x1E7FF;

    LPC_ETHERNET->DMA_INT_EN = 0;

    LPC_ETHERNET->MAC_ADDR0_HIGH = (p->iSettings.iMACAddress[5] << 8) |
                                   (p->iSettings.iMACAddress[4]);
    LPC_ETHERNET->MAC_ADDR0_LOW =  (p->iSettings.iMACAddress[3] << 24) |
                                   (p->iSettings.iMACAddress[2] << 16) |
                                   (p->iSettings.iMACAddress[1] << 8) |
                                   (p->iSettings.iMACAddress[0]);
    
    LPC_ETHERNET->MAC_CONFIG =  (3<<17) | (1<<15) | (1 << 14) | (1<<13) | (1 << 11) | (1 << 10);

    /* Setup default filter */
    LPC_ETHERNET->MAC_FRAME_FILTER = (1<<0) | (1UL<<31);

    UEZTaskDelay(500);

    // Find the PHY address
    for (addr = 0; addr < 16; addr++) {
        p->iSettings.iPHYAddr = addr << 11;
        v = IPHYRead(p, PHY_REG_IDR1);
#if DEBUG_LPC43xx_EMAC_STARTUP
        printf("ADDR: %d, v=%04X\n", addr, v);
#endif
        if (v != 0xFFFF) {
            break;
        }
    }
#if DEBUG_LPC43xx_EMAC_STARTUP
    printf("Addr: %d, Settings: %08X\n", addr, p->iSettings.iPHYAddr);
#endif

    /* Put the Phy in reset mode */
    IPHYWrite(p, PHY_REG_BMCR, 0x8000);
    UEZTaskDelay(1);

