FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_EMAC.c
    // Wait for hardware reset to end.
    // We try 100 times with a 10 ms delay for a complete
    // time of 1 second.
    retry = 3;
    do {
        for (timeout = 0; timeout < 100; timeout++) {
            UEZTaskDelay(10);
            regv = IPHYRead(p, PHY_REG_BMCR);
            if (!(regv & 0x8000)) {
                // Reset complete
                break;
            }
        }
#if DEBUG_LPC43xx_EMAC_STARTUP
        printf("regv=%04X\n", regv);
#endif
    } while ((timeout == 100) && (--retry));

    if (!retry) {
        // report a timeout on the initialization
        return UEZ_ERROR_TIMEOUT;
    }

    // Setup PAUSE control (PAUSE and ASM_DIR in ANAR register)
    regv = IPHYRead(p, PHY_REG_ANAR);
#if DEBUG_LPC43xx_EMAC_STARTUP
    printf("pause regv=%04X\n", regv);
#endif
    //IPHYWrite(p, PHY_REG_ANAR, regv | (1 << 10) | (1 << 11));

    uniqueID = (IPHYRead(p, PHY_REG_IDR1) << 16) | IPHYRead(p, PHY_REG_IDR2);
#if DEBUG_LPC43xx_EMAC_STARTUP
    printf("PHY ID: %08X\n", uniqueID);
#endif

    switch (uniqueID) {
        case 0x20005C90: // National PHY
            error = IEMACConfigPHY_National(p);
            break;
        case 0x00221610: // Micrel
        case 0x00221512: // Micrel KSZ8041TL-FTL
        case 0x00221513: // Micrel KSZ8041NL
        case 0x00221555: //Micrel KSZ8051
#if DEBUG_LPC43xx_EMAC_STARTUP
            printf("Micrel init\n");
#endif
            error = IEMACConfigPHY_Micrel(p);
            break;
        case 0x0007C0F1: // SMSC LAN8720
        case 0x000740F1: // SMSC LAN8720 (optional other ID)
#if DEBUG_LPC43xx_EMAC_STARTUP
            printf("SMSC LAN8720 init\n");
#endif
            // Uses same initialization as Micrel
            error = IEMACConfigPHY_Micrel(p);
            break;
        default:
            // auto negotiation, restart AN
            // RE_AN should be self cleared
            IPHYWrite(p, PHY_REG_BMCR, PHY_AUTO_NEG);
#if DEBUG_LPC43xx_EMAC_STARTUP
            printf("Unknown PHY: %08X\n", uniqueID);
#endif
            return UEZ_ERROR_NOT_SUPPORTED;
    }

    // Initialize Tx and Rx DMA Descriptors
    ILPC43xx_EMAC_InitTxDescriptors();
    ILPC43xx_EMAC_InitRxDescriptors();
    p->iReceiveIndex = 0;
    p->iTransmitIndex = 0;

    /* Flush transmit FIFO */
    LPC_ETHERNET->DMA_OP_MODE = (1<<20);

    /* Setup DMA to flush receive FIFOs at 32 bytes, service TX FIFOs at
       64 bytes */
    LPC_ETHERNET->DMA_OP_MODE |= (1<<3) | (0<<14);

    /* Clear all MAC interrupts */
    LPC_ETHERNET->DMA_STAT = 0x1E7FF;

    /* Enable MAC interrupts */
    LPC_ETHERNET->DMA_INT_EN = (1 << 0) | (1 << 4) | (1 << 5) | (1 << 6) |
                               (1 << 16) | (1 << 15) | (1 << 2) | (1 << 7);

    LPC_ETHERNET->DMA_OP_MODE |= /*(1 << 24) |*/ (1 << 13) | (1 << 1);
    
    /* Enable receive and transmit mode of MAC Ethernet core */
    LPC_ETHERNET->MAC_CONFIG |= (1 << 3) | (1 << 2);

#if(EMAC_ENABLE_JUMBO_FRAME == 1)    
    // Enable Jumber Frame (bit 20, Jumbo Frame Enable)
    LPC_ETHERNET->MAC_CONFIG |= ETHERNET_MAC_CONFIG_JE_Msk;
#endif
    
    LPC_ETHERNET->DMA_REC_POLL_DEMAND = 1;

    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_CheckFrameReceived
 *---------------------------------------------------------------------------*
 * Description:
 *      Determine if a frame has been received.
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 * Outputs:
 *      TBool                     -- ETrue if frame received, else EFalse.
 *---------------------------------------------------------------------------*/
TBool LPC43xx_EMAC_CheckFrameReceived(void *aWorkspace)
{
    ENET_RXDESC_T *p_rdesc;
    T_LPC43xx_EMAC_Workspace *p = (T_LPC43xx_EMAC_Workspace *)aWorkspace;
    p_rdesc = (ENET_RXDESC_T *)&RXDescs[p->iReceiveIndex];

    // Ensure we poll for demand
    LPC_ETHERNET->DMA_REC_POLL_DEMAND = 1;

    // Is the current descriptor waiting for us?
    if ((p_rdesc->STATUS & RXDESC_STATUS_OWN)==0) {
        // Not owned by DMA, so it is for us!
        return ETrue;
    }

    return EFalse;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_StartReadFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Reads the length of the received ethernet frame.  Returns the
 *      frame length.
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 * Outputs:
 *      TUInt16                   -- Size of frame
 *---------------------------------------------------------------------------*/
TUInt16 LPC43xx_EMAC_StartReadFrame(void *aWorkspace)
{
    TUInt16 RxLen = 0;
    T_LPC43xx_EMAC_Workspace *p = (T_LPC43xx_EMAC_Workspace *)aWorkspace;
    ENET_ENHRXDESC_T *pd = &RXDescs[p->iReceiveIndex];

    // Just get hte current receive index's size
    RxLen = RXDESC_STATUS_FLEN(pd->STATUS);
    p->rptr = &RXBuffer[p->iReceiveIndex][0];

    return RxLen;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_EndReadFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      End the last frame.
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 *---------------------------------------------------------------------------*/
void LPC43xx_EMAC_EndReadFrame(void *aWorkspace)
{
    T_LPC43xx_EMAC_Workspace *p = (T_LPC43xx_EMAC_Workspace *)aWorkspace;
    ENET_ENHRXDESC_T *pd = &RXDescs[p->iReceiveIndex];

    // Mark owned by DMA now
    pd->STATUS |= RXDESC_STATUS_OWN;

    // Move to the next free slot
    p->iReceiveIndex++;
    if (p->iReceiveIndex >= ENET_NUM_RX_DESC)
        p->iReceiveIndex = 0;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_RequestSend
 *---------------------------------------------------------------------------*
 * Description:
 *      Requests space in EMAC memory for storing an outgoing frame
 * Inputs:
 *      void *aWorkspace          -- EMAC Controller's workspace
 *---------------------------------------------------------------------------*/
void LPC43xx_EMAC_RequestSend(void *aWorkspace)
{
    T_LPC43xx_EMAC_Workspace *p = (T_LPC43xx_EMAC_Workspace *)aWorkspace;
    ENET_ENHTXDESC_T *pd = &TXDescs[p->iTransmitIndex];

// TODO: It would have been nice to respond with a 'false' if there is
// no room to send data!
    if (pd->CTRLSTAT & TXDESC_STATUS_OWN) {
#if DEBUG_LPC43xx_EMAC_PACKETS_OUT
        printf("Error!  No room to send packets!\n");
#endif
        p->tptr = 0;
        p->tsize = 0;
    } else {
        // Start the pointer here
        p->tptr = &TXBuffer[p->iTransmitIndex][0];
        p->tsize = 0;
// TESTING:  Clear the packet before we put data into it so we can see
//           if we didn't write to the whole packet
        memset(p->tptr, 0xCC, sizeof(TXBuffer[p->iTransmitIndex]));
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_DoSend
 *---------------------------------------------------------------------------*
 * Description:
 *      Send the frame
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      TUInt16 aFrameSize          -- Size of frame
 *---------------------------------------------------------------------------*/
void LPC43xx_EMAC_DoSend(void *aWorkspace, TUInt16 aFrameSize)
{
    T_LPC43xx_EMAC_Workspace *p = (T_LPC43xx_EMAC_Workspace *)aWorkspace;
    ENET_ENHTXDESC_T *pd = &TXDescs[p->iTransmitIndex];

