FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_EMAC.c
    if (p->tptr) {
#if DEBUG_LPC43xx_EMAC_PACKETS_OUT
        printf("Sending %d\n", p->iTransmitIndex);
        if (aFrameSize != p->tsize) {
            printf("Error!  Transfer sizes do not match! (%d != %d)", aFrameSize, p->tsize);
        }
#endif
        // Write the final size to send
        pd->BSIZE = aFrameSize; // cut off CRC and let the system create it

        // Give the block to the DMA to send out the network.  It'll clear
        // it when done.
        pd->CTRLSTAT |= TXDESC_STATUS_OWN | TXDESC_STATUS_LS | TXDESC_STATUS_FS;

        // Move to next transmit block
        p->iTransmitIndex++;
        if (p->iTransmitIndex >= ENET_NUM_TX_DESC)
            p->iTransmitIndex = 0;

        // No pointer declared
        p->tptr = 0;
    } else {
#if DEBUG_LPC43xx_EMAC_PACKETS_OUT
        printf("Sending data to nowhere!\n");
#endif
    }

    // Ensure we tell the MAC to check the descriptors to send everything
    LPC_ETHERNET->DMA_TRANS_POLL_DEMAND = 1;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_CopyToFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Copies bytes from MCU-memory to frame port
 *      NOTES:
 *        - an odd number of byte may only be transfered
 *                  if the frame is written to the end!
 *        - MCU-memory MUST start at word-boundary
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      void *aSource               -- Location of data to send
 *      TUInt32 aSize               -- Number of bytes to send
 *---------------------------------------------------------------------------*/
void LPC43xx_EMAC_CopyToFrame(void *aWorkspace, void *aSource, TUInt32 aSize)
{
    T_LPC43xx_EMAC_Workspace *p = (T_LPC43xx_EMAC_Workspace *)aWorkspace;

    if (p->tptr) {
        // NOTE: We're not checking to see if there is room!
        memcpy(p->tptr, aSource, aSize);

#if DEBUG_LPC43xx_EMAC_PACKETS_OUT
        printf("OUT Packet %4d%s\n", aSize, (p->tptr != &TXBuffer[p->iTransmitIndex][0])?" (continuation)":"");
        int32_t len = aSize;
        for (int32_t i=0; i<len; i++) {
            printf("%02X ", ((TUInt8 *)aSource)[i]);
            if ((i%16) == 15)
                printf("\n");
        }
         printf("\n");
#endif

         p->tptr += aSize;
         p->tsize += aSize;
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_CopyFromFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Copies bytes from frame port to MCU-memory
 *      This routine can be called multiple times to break up packets
 *      into smaller pbufs or sections.
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      void *aDestination          -- Location to store data
 *      TUInt32 aSize               -- Number of bytes to copy
 *---------------------------------------------------------------------------*/
void LPC43xx_EMAC_CopyFromFrame(
    void *aWorkspace,
    void *aDestination,
    TUInt32 aSize)
{
    T_LPC43xx_EMAC_Workspace *p = (T_LPC43xx_EMAC_Workspace *)aWorkspace;
    memcpy(aDestination, p->rptr, aSize);

#if DEBUG_LPC43xx_EMAC_PACKETS_IN
    printf("IN  Packet %4d%s\n", aSize, (p->rptr != &RXBuffer[p->iReceiveIndex][0])?" (continuation)":"");
    int32_t len = aSize;
    for (int32_t i=0; i<len; i++) {
        printf("%02X ", ((TUInt8 *)aDestination)[i]);
        if ((i%16) == 15)
            printf("\n");
    }
     printf("\n");
#endif

     // TESTING
//     memset(p->rptr, 0xCC, aSize));

     p->rptr += aSize;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_ProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      An interrupt on this EMAC has been received.  Catch it and
 *      possible pass it on to a callback routine.
 *---------------------------------------------------------------------------*/
static void LPC43xx_EMAC_ProcessInterrupt(void)
{
    T_LPC43xx_EMAC_Workspace *p = G_LPC43xx_EMAC;
    TUInt32 status;

    // Clear the interrupt.
    status = LPC_ETHERNET->DMA_STAT;
    if (status & (1<<6)) {
        if (p->iReceiveCallback) {
            p->iReceiveCallback(p->iReceiveCallbackWorkspace);
        }
    }
#if (EMAC_USE_INTERRUPT_TIMEOUT_DETECT == 1)
    p->iPhyTimeoutDetect = 0;
#endif
    // Clear any interrupts that triggered this code
    LPC_ETHERNET->DMA_STAT = status;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_ISR
 *---------------------------------------------------------------------------*
 * Description:
 *      Stub to catch a EMAC interrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE( LPC43xx_EMAC_ISR)
{
    IRQ_START();
    LPC43xx_EMAC_ProcessInterrupt();
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_EnableReceiveInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable interrupts to occur when packets are received by the EMAC
 *      instead of just polling for the data.  The given callback routine
 *      will be called per interrupt.  The callback routine is called
 *      from withing the interrupt routine, so it should merely set
 *      a flag, release a semaphore, or any other minimal processing, and
 *      return quickly.
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      T_uezEMACReceiveInterruptCallback aCallback -- Routine to call on
 *          interrupts.  Can be set to 0 for no processing.
 *      void *aCallbackWorkspace -- Workspace pointer to pass to callback
 *          or 0 for none.
 *---------------------------------------------------------------------------*/
void LPC43xx_EMAC_EnableReceiveInterrupt(
    void *aWorkspace,
    T_uezEMACReceiveInterruptCallback aCallback,
    void *aCallbackWorkspace)
{
    T_LPC43xx_EMAC_Workspace *p = (T_LPC43xx_EMAC_Workspace *)aWorkspace;

    p->iReceiveCallback = aCallback;
    p->iReceiveCallbackWorkspace = aCallbackWorkspace;
    // Register this interrupt (if not already)
#ifdef CORE_M4
    if(InterruptIsRegistered(ETHERNET_IRQn) == EFalse) {
      InterruptRegister(ETHERNET_IRQn, (TISRFPtr)LPC43xx_EMAC_ISR,
          INTERRUPT_PRIORITY_HIGH, "EMAC");
    }
    InterruptEnable(ETHERNET_IRQn);
#endif
#ifdef CORE_M0
    if(InterruptIsRegistered(M0_ETHERNET_IRQn) == EFalse) {
      InterruptRegister(M0_ETHERNET_IRQn, (TISRFPtr)LPC43xx_EMAC_ISR,
          INTERRUPT_PRIORITY_HIGH, "EMAC");
    }
    InterruptEnable(M0_ETHERNET_IRQn);
#endif
#ifdef CORE_M0SUB
    // None
#endif
    // Turn on those types of interrupts
    //LPC_ETHERNET->DMA_INT_EN = (1<<16) | (1<<6);//INT_RX_DONE;
    LPC_ETHERNET->DMA_INT_EN = (1 << 0) | (1 << 4) | (1 << 5) | (1 << 6) |
                               (1 << 16) | (1 << 15) | (1 << 2) | (1 << 7);
    LPC_ETHERNET->DMA_REC_POLL_DEMAND = 1;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_DisableReceiveInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Disables receive interrupts from the EMAC.
 *---------------------------------------------------------------------------*/
void LPC43xx_EMAC_DisableReceiveInterrupt(void *aWorkspace)
{
    PARAM_NOT_USED(aWorkspace);
    // Turn off those types of interrupts
    LPC_ETHERNET->DMA_INT_EN = 0;//INT_RX_DONE;
    // Turn off the whole interrutp since it is the only one
#ifdef CORE_M4
    InterruptDisable(ETHERNET_IRQn);
#endif
#ifdef CORE_M0
    InterruptDisable(M0_ETHERNET_IRQn);
#endif
#ifdef CORE_M0SUB
    // None
#endif
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the workspace for this EMAC Controller
 * Inputs:
 *      void *aWorkspace          -- Memory allocated for workspace area.
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC43xx_EMAC_InitializeWorkspace(void *aWorkspace)
{
    T_LPC43xx_EMAC_Workspace *p = (T_LPC43xx_EMAC_Workspace *)aWorkspace;

    G_LPC43xx_EMAC = p;
    p->iIsDetected = EFalse;

    // Ensure our pointers and indexes are zero'd out
    p->tptr = 0;
    p->rptr = 0;
    p->iReceiveIndex = 0;
    p->iTransmitIndex = 0;
    
