FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_EMAC.c
#if (EMAC_USE_INTERRUPT_TIMEOUT_DETECT == 1)
    p->iPhyTimeoutDetect = 0;
#endif

    return UEZ_ERROR_NONE;
}

TUInt16* LPC43xx_EMAC_GetPhyTimeoutCounter(void) {
#if (EMAC_USE_INTERRUPT_TIMEOUT_DETECT == 1)
  return &G_LPC43xx_EMAC->iPhyTimeoutDetect;
#else
  return 0;
#endif

}    

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_EMAC G_LPC43xx_EMAC_Interface = {
    {
        "LPC43xx EMAC",
        0x0100,
        LPC43xx_EMAC_InitializeWorkspace,
        sizeof(T_LPC43xx_EMAC_Workspace), },

    LPC43xx_EMAC_Configure,
    LPC43xx_EMAC_CheckFrameReceived,
    LPC43xx_EMAC_StartReadFrame,
    LPC43xx_EMAC_EndReadFrame,
    LPC43xx_EMAC_RequestSend,
    LPC43xx_EMAC_DoSend,
    LPC43xx_EMAC_CopyToFrame,
    LPC43xx_EMAC_CopyFromFrame,

    // uEZ v1.10
    LPC43xx_EMAC_EnableReceiveInterrupt,
    LPC43xx_EMAC_DisableReceiveInterrupt,
    // uEZ v2.14
#if (EMAC_USE_INTERRUPT_TIMEOUT_DETECT == 1)
    LPC43xx_EMAC_GetPhyTimeoutCounter,
#endif
};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*
 * Routine:  LPC43xx_EMAC_RMII_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Creates the EMAC HAL driver for the LPC43xx device.  Also looks
 *      to see if it exists.  If found, sets the value in *aIsFound to ETrue.
 *      If NOT found, the value in *aIsFound IS NOT CHANGED!  Set *aIsFound
 *      to EFalse before calling this routine.
 * Inputs:
 *      T_LPC43xx_EMAC_Settings *aSettings -- Settings to configure EMAC as
 *      TBool *aIsFound -- REturned flag if found
 *---------------------------------------------------------------------------*/
#define EMAC_DRIVE(mode)             SCU_NORMAL_DRIVE(mode, \
                                                   SCU_EPD_DISABLE, \
                                                   SCU_EPUN_DISABLE, \
                                                   SCU_EHS_FAST, \
                                                   SCU_EZI_ENABLE, \
                                                   SCU_ZIF_ENABLE)
// Disable input buffer
#define EMAC_DRIVE_OUTPUT_ONLY(mode) SCU_NORMAL_DRIVE(mode, \
                                                   SCU_EPD_DISABLE, \
                                                   SCU_EPUN_DISABLE, \
                                                   SCU_EHS_FAST, \
                                                   SCU_EZI_DISABLE, \
                                                   SCU_ZIF_ENABLE)
void LPC43xx_EMAC_RMII_Require(const T_LPC43xx_EMAC_Settings *aSettings)
{
    T_LPC43xx_EMAC_Workspace *p;
    // Note that all of these are normal drive pins on this LPC. TODO do we want to disable input buffer on TX only pins?
    static const T_LPC43xx_SCU_ConfigList TX_EN[] = {
            {GPIO_P0_1       , SCU_NORMAL_DRIVE_DEFAULT(6)}, //TX Enable
            {GPIO_P6_3       , SCU_NORMAL_DRIVE_DEFAULT(3)}, //TX Enable
    };
    static const T_LPC43xx_SCU_ConfigList TXD3[] = {
            {GPIO_P5_18      , SCU_NORMAL_DRIVE_DEFAULT(5)}, //TXD 3
            {GPIO_P6_2       , SCU_NORMAL_DRIVE_DEFAULT(3)}, //TXD 3
    };
    static const T_LPC43xx_SCU_ConfigList TXD2[] = {
            {GPIO_P5_17      , SCU_NORMAL_DRIVE_DEFAULT(5)}, //TXD 2
            {GPIO_P6_1       , SCU_NORMAL_DRIVE_DEFAULT(3)}, //TXD 2
    };
    static const T_LPC43xx_SCU_ConfigList TXD1[] = {
            {GPIO_P0_15      , SCU_NORMAL_DRIVE_DEFAULT(3)}, //TXD 1
    };
    static const T_LPC43xx_SCU_ConfigList TXD0[] = {
            {GPIO_P0_13      , SCU_NORMAL_DRIVE_DEFAULT(3)}, //TXD 0
    };
    static const T_LPC43xx_SCU_ConfigList TX_ER[] = {
            {GPIO_P6_4       , SCU_NORMAL_DRIVE_DEFAULT(4)}, //TX Error
            {GPIO_P6_13      , SCU_NORMAL_DRIVE_DEFAULT(6)}, //TX Error
    };
    static const T_LPC43xx_SCU_ConfigList TX_CLK[] = { // This is actually an input clock pin ENET_REFCLK
            {GPIO_PZ_0_P1_19 , SCU_NORMAL_DRIVE(0, (1 << 7) , (1 << 6) , (1 << 5) , (1 << 4), (0 << 3))}, //TX Clk
    };
    static const T_LPC43xx_SCU_ConfigList RX_DV[] = {
            {GPIO_P0_3       , SCU_NORMAL_DRIVE_DEFAULT(7)}, //RX DV
            {GPIO_P6_7       , SCU_NORMAL_DRIVE_DEFAULT(3)}, //RX DV
    };
    static const T_LPC43xx_SCU_ConfigList RXD3[] = {
            {GPIO_P4_14      , SCU_NORMAL_DRIVE_DEFAULT(5)}, //RXD 3
            {GPIO_P6_6       , SCU_NORMAL_DRIVE_DEFAULT(3)}, //RXD 3
    };
    static const T_LPC43xx_SCU_ConfigList RXD2[] = {
            {GPIO_P4_15      , SCU_NORMAL_DRIVE_DEFAULT(5)}, //RXD 2
            {GPIO_P6_5       , SCU_NORMAL_DRIVE_DEFAULT(3)}, //RXD 2
    };
    static const T_LPC43xx_SCU_ConfigList RXD1[] = {
            {GPIO_P0_0       , SCU_NORMAL_DRIVE_DEFAULT(2)}, //RXD 1
    };
    static const T_LPC43xx_SCU_ConfigList RXD0[] = {
            {GPIO_P0_2       , SCU_NORMAL_DRIVE_DEFAULT(3)}, //RXD 0
    };
    static const T_LPC43xx_SCU_ConfigList RX_ER[] = {
            {GPIO_P4_13      , SCU_NORMAL_DRIVE_DEFAULT(5)}, //RX Error
            {GPIO_P6_8       , SCU_NORMAL_DRIVE_DEFAULT(3)}, //RX Error
    };
    static const T_LPC43xx_SCU_ConfigList RX_CLK[] = {
            {GPIO_PZ_Z_PC_0  , SCU_NORMAL_DRIVE(3, (1 << 7) , (1 << 6) , (1 << 5) , (1 << 4), (0 << 3))}, //RX Clk
    };
    static const T_LPC43xx_SCU_ConfigList COL[] = {
            {GPIO_P0_1       , SCU_NORMAL_DRIVE_DEFAULT(2)}, //COL
            {GPIO_P2_1       , SCU_NORMAL_DRIVE_DEFAULT(7)}, //COL
            {GPIO_P4_11      , SCU_NORMAL_DRIVE_DEFAULT(5)}, //COL
    };
    static const T_LPC43xx_SCU_ConfigList CRS[] = {
            {GPIO_P0_3       , SCU_NORMAL_DRIVE_DEFAULT(3)}, //CRS
            {GPIO_P4_2       , SCU_NORMAL_DRIVE_DEFAULT(5)}, //CRS
    };
    static const T_LPC43xx_SCU_ConfigList MDC[] = {
            {GPIO_P5_0       , SCU_NORMAL_DRIVE_DEFAULT(7)}, //MDC
            {GPIO_P3_15      , SCU_NORMAL_DRIVE_DEFAULT(6)}, //MDC
            {GPIO_P6_0       , SCU_NORMAL_DRIVE_DEFAULT(3)}, //MDC
    };
    static const T_LPC43xx_SCU_ConfigList MDIO[] = {
            {GPIO_P0_12      , SCU_NORMAL_DRIVE_DEFAULT(3)}, //MDIO
    };

    HAL_DEVICE_REQUIRE_ONCE();

    // Register EMAC
    HALInterfaceRegister("EMAC", (T_halInterface *)&G_LPC43xx_EMAC_Interface, 0,
        (T_halWorkspace **)&p);

    LPC43xx_SCU_ConfigPinOrNone(aSettings->iTX_EN, TX_EN, ARRAY_COUNT(TX_EN));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iTXD3, TXD3, ARRAY_COUNT(TXD3));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iTXD2, TXD2, ARRAY_COUNT(TXD2));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iTXD1, TXD1, ARRAY_COUNT(TXD1));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iTXD0, TXD0, ARRAY_COUNT(TXD0));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iTX_ER, TX_ER,
            ARRAY_COUNT(TX_ER));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iTX_CLK, TX_CLK,
            ARRAY_COUNT(TX_CLK));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iRX_DV, RX_DV,
            ARRAY_COUNT(RX_DV));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iRXD3, RXD3,
            ARRAY_COUNT(RXD3));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iRXD2, RXD2,
            ARRAY_COUNT(RXD2));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iRXD1, RXD1, ARRAY_COUNT(RXD1));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iRXD0, RXD0, ARRAY_COUNT(RXD0));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iRX_ER, RX_ER, ARRAY_COUNT(RX_ER));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iRX_CLK, RX_CLK, ARRAY_COUNT(RX_CLK));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iCOL, COL, ARRAY_COUNT(COL));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iCRS, CRS, ARRAY_COUNT(CRS));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iMDC, MDC, ARRAY_COUNT(MDC));
    LPC43xx_SCU_ConfigPinOrNone(aSettings->iMDIO, MDIO, ARRAY_COUNT(MDIO));

#if EMAC_USE_BITBANG_MDIO_DETECT
    p->iMDIOSettings.iDelayUSPerHalfBit = EMAC_BITBANG_MDIO_DELAY_US;
    p->iMDIOSettings.iIsClause45 = EFalse;
    p->iMDIOSettings.iPinMDC = aSettings->iMDC;
    p->iMDIOSettings.iPinMDIO = aSettings->iMDIO;
    if (LPC43xx_EMAC_DetectEMAC(p) == UEZ_ERROR_NONE)
        p->iIsDetected = ETrue;
#else
    p->iIsDetected = ETrue;
#endif
}

/*-------------------------------------------------------------------------*
 * End of File:  EMAC.c
 *-------------------------------------------------------------------------*/
